schema-uml.md
```mermaid
erDiagram
    User ||--o{ Belongs : "appartient à"
    Team ||--o{ Belongs : "contient"
    User ||--o{ Team : "possède"
    User ||--o{ Leave : "a"
    User ||--o{ Clocking : "enregistre"
    User ||--o{ Warning : "reçoit"
    User ||--o{ Warning : "crée"
    User ||--o{ Receive : "reçoit"
    Notification ||--o{ Receive : "envoyée à"
    
    User {
        int id PK
        string firstName
        string lastName
        string email UK
        string phoneNumber
        string password
        enum role
        enum contractType
        string avatarUrl
        int totalWarningPoints
        decimal totalPayeLeave
        int totalRemote
        int weeklyLeaveLimit
        datetime lastWeekReset
        decimal monthlyLeaveGain
        datetime lastMonthlyReset
        datetime createdAt
        datetime updatedAt
        datetime deletedAt
    }
    
    Team {
        int id PK
        string teamName
        string description
        int ownerId FK
        datetime createdAt
        datetime updatedAt
    }
    
    Belongs {
        int teamId PK,FK
        int userId PK,FK
        datetime joinedAt
        boolean isLead
        datetime createdAt
        datetime updatedAt
    }
    
    Leave {
        int id PK
        date startDate
        date endDate
        string justification
        enum status
        int daysLeave
        enum type
        int userId FK
        datetime createdAt
        datetime updatedAt
    }
    
    Clocking {
        int id PK
        time firstArrival
        time lastDeparture
        int workTime
        int breakTime
        date clockingDate
        decimal totalHours
        enum weekDay
        int userId FK
        datetime createdAt
        datetime updatedAt
    }
    
    Warning {
        int id PK
        enum status
        string description
        date date
        int createdById FK
        int userId FK
        datetime createdAt
        datetime updatedAt
    }
    
    Notification {
        int id PK
        string message
        string title
        enum status
        date date
        boolean isRead
        datetime createdAt
        datetime updatedAt
    }
    
    Receive {
        int userId PK,FK
        int notificationId PK,FK
        datetime createdAt
        datetime updatedAt
    }
```
